// -----// IR Dump Before AFHandleFallbackPass (af-handle-fallback) //----- //
module {
  func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
    %cst = "tf.Const"() {_symbolic_output_shapes = [#tf_type.shape<>], device = "", value = dense<0> : tensor<i32>} : () -> tensor<i32>
    %cst_0 = "tf.Const"() {_symbolic_output_shapes = [#tf_type.shape<>], device = "", value = dense<1> : tensor<i32>} : () -> tensor<i32>
    %0 = "tf.Sum"(%arg0, %cst_0) {_symbolic_output_shapes = [#tf_type.shape<137>], device = "", keep_dims = false} : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
    %1 = "tf.GatherV2"(%arg1, %0, %cst) {_symbolic_output_shapes = [#tf_type.shape<137x4>], batch_dims = 0 : i64, device = ""} : (tensor<?x4xf32>, tensor<?xi32>, tensor<i32>) -> tensor<?x4xf32>
    %2 = "tf.Sum"(%arg2, %cst_0) {_symbolic_output_shapes = [#tf_type.shape<137>], device = "", keep_dims = false} : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
    %3 = "tf.GatherV2"(%arg3, %2, %cst) {_symbolic_output_shapes = [#tf_type.shape<137x4>], batch_dims = 0 : i64, device = ""} : (tensor<?x4xf32>, tensor<?xi32>, tensor<i32>) -> tensor<?x4xf32>
    %4 = "tf.Sum"(%arg4, %cst_0) {_symbolic_output_shapes = [#tf_type.shape<137>], device = "", keep_dims = false} : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
    %5 = "tf.GatherV2"(%arg5, %4, %cst) {_symbolic_output_shapes = [#tf_type.shape<137x4>], batch_dims = 0 : i64, device = ""} : (tensor<?x4xf32>, tensor<?xi32>, tensor<i32>) -> tensor<?x4xf32>
    return %1, %3, %5 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
  }
}


// -----// IR Dump After AFHandleFallbackPass (af-handle-fallback) //----- //
module {
  func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
    %cst = "tf.Const"() {_symbolic_output_shapes = [#tf_type.shape<>], device = "", value = dense<0> : tensor<i32>} : () -> tensor<i32>
    %cst_0 = "tf.Const"() {_symbolic_output_shapes = [#tf_type.shape<>], device = "", value = dense<1> : tensor<i32>} : () -> tensor<i32>
    %0 = "tf.Sum"(%arg0, %cst_0) {_symbolic_output_shapes = [#tf_type.shape<137>], device = "", keep_dims = false} : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
    %1 = "tf.GatherV2"(%arg1, %0, %cst) {_symbolic_output_shapes = [#tf_type.shape<137x4>], batch_dims = 0 : i64, device = ""} : (tensor<?x4xf32>, tensor<?xi32>, tensor<i32>) -> tensor<?x4xf32>
    %2 = "tf.Sum"(%arg2, %cst_0) {_symbolic_output_shapes = [#tf_type.shape<137>], device = "", keep_dims = false} : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
    %3 = "tf.GatherV2"(%arg3, %2, %cst) {_symbolic_output_shapes = [#tf_type.shape<137x4>], batch_dims = 0 : i64, device = ""} : (tensor<?x4xf32>, tensor<?xi32>, tensor<i32>) -> tensor<?x4xf32>
    %4 = "tf.Sum"(%arg4, %cst_0) {_symbolic_output_shapes = [#tf_type.shape<137>], device = "", keep_dims = false} : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
    %5 = "tf.GatherV2"(%arg5, %4, %cst) {_symbolic_output_shapes = [#tf_type.shape<137x4>], batch_dims = 0 : i64, device = ""} : (tensor<?x4xf32>, tensor<?xi32>, tensor<i32>) -> tensor<?x4xf32>
    return %1, %3, %5 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
  }
}


// -----// IR Dump Before LegalizeTFNoFallback (xla-legalize-tf-no-fallback) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %cst = "tf.Const"() {_symbolic_output_shapes = [#tf_type.shape<>], device = "", value = dense<0> : tensor<i32>} : () -> tensor<i32>
  %cst_0 = "tf.Const"() {_symbolic_output_shapes = [#tf_type.shape<>], device = "", value = dense<1> : tensor<i32>} : () -> tensor<i32>
  %0 = "tf.Sum"(%arg0, %cst_0) {_symbolic_output_shapes = [#tf_type.shape<137>], device = "", keep_dims = false} : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %1 = "tf.GatherV2"(%arg1, %0, %cst) {_symbolic_output_shapes = [#tf_type.shape<137x4>], batch_dims = 0 : i64, device = ""} : (tensor<?x4xf32>, tensor<?xi32>, tensor<i32>) -> tensor<?x4xf32>
  %2 = "tf.Sum"(%arg2, %cst_0) {_symbolic_output_shapes = [#tf_type.shape<137>], device = "", keep_dims = false} : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %3 = "tf.GatherV2"(%arg3, %2, %cst) {_symbolic_output_shapes = [#tf_type.shape<137x4>], batch_dims = 0 : i64, device = ""} : (tensor<?x4xf32>, tensor<?xi32>, tensor<i32>) -> tensor<?x4xf32>
  %4 = "tf.Sum"(%arg4, %cst_0) {_symbolic_output_shapes = [#tf_type.shape<137>], device = "", keep_dims = false} : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %5 = "tf.GatherV2"(%arg5, %4, %cst) {_symbolic_output_shapes = [#tf_type.shape<137x4>], batch_dims = 0 : i64, device = ""} : (tensor<?x4xf32>, tensor<?xi32>, tensor<i32>) -> tensor<?x4xf32>
  return %1, %3, %5 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump After LegalizeTFNoFallback (xla-legalize-tf-no-fallback) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.constant dense<1> : tensor<i32>
  %2 = mhlo.convert %arg0 : tensor<?x2xi32>
  %3 = mhlo.constant dense<0> : tensor<i32>
  %4 = mhlo.reduce(%2 init: %3) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %5 = mhlo.convert %4 : tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg1, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %7 = mhlo.convert %arg2 : tensor<?x2xi32>
  %8 = mhlo.constant dense<0> : tensor<i32>
  %9 = mhlo.reduce(%7 init: %8) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %10 = mhlo.convert %9 : tensor<?xi32>
  %11 = "mhlo.torch_index_select"(%arg3, %10) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %12 = mhlo.convert %arg4 : tensor<?x2xi32>
  %13 = mhlo.constant dense<0> : tensor<i32>
  %14 = mhlo.reduce(%12 init: %13) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %15 = mhlo.convert %14 : tensor<?xi32>
  %16 = "mhlo.torch_index_select"(%arg5, %15) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %6, %11, %16 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump Before RankSpecializationClusterPass (mhlo-rank-specialization-cluster) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.constant dense<1> : tensor<i32>
  %2 = mhlo.convert %arg0 : tensor<?x2xi32>
  %3 = mhlo.constant dense<0> : tensor<i32>
  %4 = mhlo.reduce(%2 init: %3) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %5 = mhlo.convert %4 : tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg1, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %7 = mhlo.convert %arg2 : tensor<?x2xi32>
  %8 = mhlo.constant dense<0> : tensor<i32>
  %9 = mhlo.reduce(%7 init: %8) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %10 = mhlo.convert %9 : tensor<?xi32>
  %11 = "mhlo.torch_index_select"(%arg3, %10) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %12 = mhlo.convert %arg4 : tensor<?x2xi32>
  %13 = mhlo.constant dense<0> : tensor<i32>
  %14 = mhlo.reduce(%12 init: %13) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %15 = mhlo.convert %14 : tensor<?xi32>
  %16 = "mhlo.torch_index_select"(%arg5, %15) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %6, %11, %16 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump After RankSpecializationClusterPass (mhlo-rank-specialization-cluster) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump Before RankSpecializationToSCFPass (mhlo-rank-specialization-to-scf) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump After RankSpecializationToSCFPass (mhlo-rank-specialization-to-scf) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump Before ChloLegalizeToHloPass (chlo-legalize-to-hlo) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump After ChloLegalizeToHloPass (chlo-legalize-to-hlo) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump Before Canonicalizer (canonicalize) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump Before CSE (cse) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump After CSE (cse) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump Before Canonicalizer (canonicalize) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump Before ShapeSimplification (shape-simplification) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump After ShapeSimplification (shape-simplification) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump Before MergeAssumingLimitOps (merge-assuming-limit-ops) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump After MergeAssumingLimitOps (merge-assuming-limit-ops) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump Before Canonicalizer (canonicalize) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump Before CSE (cse) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %5 = mhlo.reduce(%arg4 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %6 = "mhlo.torch_index_select"(%arg5, %5) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  return %2, %4, %6 : tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>
}

// -----// IR Dump After CSE (cse) //----- //
func.func @cuda_kernel_0(%arg0: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "7:0", input.has_one_use = true}, %arg1: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "4:0", input.has_one_use = true}, %arg2: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "8:0", input.has_one_use = true}, %arg3: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "5:0", input.has_one_use = true}, %arg4: tensor<?x2xi32> {input.fake_symbolic_shape = #tf_type.shape<137x2>, input.from = "9:0", input.has_one_use = true}, %arg5: tensor<?x4xf32> {input.fake_symbolic_shape = #tf_type.shape<137x4>, input.from = "6:0", input.has_one_use = true}) -> (tensor<?x4xf32>, tensor<?x4xf32>, tensor<?x4xf32>) attributes {BatchComputeFusion, _nano_compiler_group_idx = 0 : i64, _nano_compiler_op_idx = "10", _nano_compiler_v2, batch_compute_pattern = "FuseGatherV2OpPattern", llvm.emit_c_interface, tf_entry} {
  %0 = mhlo.constant dense<0> : tensor<i32>
  %1 = mhlo.reduce(%arg0 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %2 = "mhlo.torch_index_select"(%arg1, %1) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
  %3 = mhlo.reduce(%arg2 init: %0) applies mhlo.add across dimensions = [1] : (tensor<?x2xi32>, tensor<i32>) -> tensor<?xi32>
  %4 = "mhlo.torch_index_select"(%arg3, %3) {batch_dims = 0 : i64, dim = 0 : i64} : (tensor<?x4xf32>, tensor<?xi32>) -> tensor<?x4xf32>
